/* Title for event birthday (with a name) */
"%@\\U2019s Birthday" = "วันเกิดของ %@";

/* Title for event birthday (without a name) */
"Birthday" = "วันเกิด";

"FACEBOOK_CALENDAR_NAME" = "กิจกรรม Facebook";

/* default calendar name */
"DEFAULT_CALENDAR_NAME" = "ปฏิทิน";

/* default reminders calendar name */
"DEFAULT_TASK_CALENDAR_NAME" = "เตือนความจำ";
// Also this one, sadly.  See 9806767 and 9696624
"Reminders" = "เตือนความจำ";

/* Default name for an event/reminder alarm */
"DEFAULT_REMINDER_NAME" = "เตือนความจำ";

/* Errors, returned as part of EKError object. Generally only for developers, but they might appear in UI.*/
"EVENT_NOT_MUTABLE_ERROR" = "กิจกรรมแก้ไขไม่ได้";

"NO_CALENDAR_ERROR" = "ยังไม่กำหนดค่าปฏิทิน";

"NO_START_DATE_ERROR" = "ยังไม่กำหนดค่าวันเริ่มต้น";

"NO_END_DATE_ERROR" = "ยังไม่กำหนดค่าวันสิ้นสุด";

"DATES_INVERTED_ERROR" = "วันเริ่มต้นต้องมาก่อนวันสิ้นสุด";

"UNEXPECTED_ERROR" = "เกิดข้อผิดพลาดอย่างกะทันหัน";

"CALENDAR_SOURCE_CANNOT_BE_MODIFIED" = "ปฏิทินนั้นอาจย้ายไปที่บัญชีอื่นไม่ได้";


"CALENDAR_READ_ONLY_ERROR" = "ปฏิทินอ่านได้อย่างเดียว";

"DURATION_EXCEEDS_RECURRENCE_ERROR" = "ช่วงกิจกรรมนานเกินกว่าช่วงเกิดประจำ";

"ALARM_EXCEEDS_RECURRENCE_ERROR" = "กิจกรรมเกิดขึ้นซ้ำก่อนเกิดการเตือน";

"START_DATE_FUTURE_ERROR" = "กิจกรรมในอนาคตไกลมากเกินไป";

"OCCURRENCE_COLLISION_ERROR" = "เกิดอีกหนึ่งรายการของกิจกรรมนี้ขึ้นในวันที่นี้";

"INVITES_CANNOT_MOVE_ERROR" = "การเชิญเหล่านี้ย้ายไปที่ปฏิทินอื่นไม่ได้";

"CANNOT_GEOCODE_LOCATION_ERROR" = "ที่ตั้งของแอปฯ เตือนความจำจะไม่สามารถเข้ารหัสพิกัดภูมิศาสตร์สำหรับส่งการเตือนออกไป";

/* meaningless to end users, but useful for coders. It means the event is being used with the wrong database (store). */
"WRONG_STORE_ERROR" = "กิจกรรมนั้นไม่อยู่ในโครงสร้างข้อมูลที่เก็บกิจกรรมนั้น";

/* developer error */
"SPAN_ERROR" = "ระยะช่วงห่างที่ระบุมาไม่ถูกต้อง";

"CALENDAR_HAS_NO_SOURCE" = "ปฏิทินไม่มีแหล่งข้อมูล";

"DOES_NOT_ALLOW_RECURRENCE_CHANGES" = "ช่องประจำเปลี่ยนไม่ได้";

"DOES_NOT_ALLOW_ALARM_CHANGES" = "ไม่สามารถเปลี่ยนการปลุก";

"DOES_NOT_ALLOW_ATTENDEE_CHANGES" = "ไม่สามารถเปลี่ยนผู้รับเชิญ";

"CALENDAR_IMMUTABLE" = "ปฏิทินนั้นไม่สามารถเปลี่ยนหรือลบ";

"STRUCTURED_LOCATIONS_NOT_SUPPORTED" = "บัญชีนี้ไม่รองรับที่ตั้งพร้อมกับข้อมูลพิกัดภูมิศาสตร์";

"ACTIONS_NOT_SUPPORTED" = "ผู้ใช้นี้ไม่สามารถใช้การกระทำ";

"REMINDER_LOCATIONS_NOT_SUPPORTED" = "บัญชีนี้ไม่รองรับที่ตั้งสำหรับเตือนความจำ";

"ALARM_PROXIMITY_NOT_SUPPORTED" = "บัญชีนี้ไม่รองรับการปลุกใกล้ๆ เวลา";

"RECURRING_TASK_REQUIRES_DUE_DATE_ERROR" = "การเตือนความจำอย่างประจำต้องการวันที่ครบกำหนด";

"SOURCE_PROHIBITS_CALENDAR_ADD_DELETE" = "บัญชีนั้นไม่อนุญาตให้เพิ่มหรือลบปฏิทิน";

"CALENDAR_DOES_NOT_ALLOW_EVENTS" = "ปฏิทินนั้นไม่อนุญาตให้เพิ่มกิจกรรม";

"CALENDAR_DOES_NOT_ALLOW_REMINDERS" = "ปฏิทินนั้นไม่อนุญาตให้เพิ่มเตือนความจำ";

"SOURCE_DOES_NOT_ALLOW_REMINDERS" = "บัญชีนั้นไม่รองรับเตือนความจำ";

"PRIORITY_IS_INVALID" = "ลำดับความสำคัญต้องอยู่ระหว่าง 0 และ 9";

"INVALID_ENTITY_TYPE" = "ไม่ได้เป็นประเภทที่ถูกต้องของ EKEntityType";
